/*Напишете програма – калкулатор на данъците.
В България имаме плосък данък, което означава, че винаги имаме 10% данък независимо от заплатата ни. Но в някои държави данъка зависи от това колко ни е голяма заплатата.
Именно такъв калкулатор ще направим!
Като за начало, в нашата програма трябва да въведем годишната заплата.
След това да изчислим данъка както следва:
за първите 20000 няма данък
за вторите 20000 има данък от 10%, но само върху парите надвишаващи необлагаемите доходи.
за третите 20000 данъкът е както следва: ** 0 за първите 20000 ** 10% за вторите 20000 ** 20% за парите над 40000
всички пари над 60000 се таксуват с 30% */
import java.util.Scanner;

public class TaxCalculator {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        System.out.println("Моля, въведете Вашата заплата: ");
        int salary = in.nextInt();
        double interest = 0;
        int sum = 0;
        
        if(salary <= 20000){
            System.out.println("Не плащате никакви данъци.");
        }else if(salary > 20000 && salary <= 40000){
            sum = salary - 20000;
            interest = sum * 0.1;
        }else if(salary > 40000 && salary <= 60000){
            sum = salary - 40000;
            interest = 2000 + (sum * 0.2);
        }else{
            sum = salary - 60000;
            interest = 6000 + (sum * 0.3);
        }
        System.out.printf("%.2f",interest); 
        in.close();
    }
}
